In [3]:
import pandas as pd

df = pd.read_csv('csv_data/a1.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   姓名      30 non-null     object
 1   國文      30 non-null     int64
 2   英文      30 non-null     int64
 3   數學      30 non-null     int64
 4   社會      30 non-null     int64
 5   地理      30 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.5+ KB

In [4]:
s1 = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
s1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [5]:
s1.reindex(['a','b','c','d'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [7]:
s1.reindex(['a','b','c'])

a   -5.3
b    7.2
c    3.6
dtype: float64

In [8]:
s2 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
s2

0      blue
2    purple
4    yellow
dtype: object

In [10]:
s2.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [13]:
import numpy as np
df = pd.DataFrame(np.arange(9).reshape(3,3),
             index = ['a','c','d'],
             columns = ['台北', '台中', '高雄'])

df

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [14]:
df.reindex(['a','b','c','d'])

    台北   台中   高雄
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  3.0  4.0  5.0
d  6.0  7.0  8.0

In [16]:
df.reindex(['a','c'])

   台北  台中  高雄
a   0   1   2
c   3   4   5

In [18]:
df.reindex(columns=['台北','高雄'])

   台北  高雄
a   0   2
c   3   5
d   6   8

In [20]:
df[['台北','高雄']]

   台北  高雄
a   0   2
c   3   5
d   6   8

In [22]:
df.reindex(columns=['台北','高雄'],index=['a','d'])

   台北  高雄
a   0   2
d   6   8

In [23]:
s3 = pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])
s3

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [24]:
s3.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [25]:
s3.drop(['a','e'])

b    1.0
c    2.0
d    3.0
dtype: float64

In [27]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [29]:
data.drop(['台北','台中'])

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [32]:
data.drop(['one','two'],axis='columns')

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [36]:
data.drop('台北',inplace=True)

In [37]:
data

    one  two  three  four
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15